---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoOutputNode
source: html/bb920964-5fdc-52eb-bc09-79c4fe19c246.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoOutputNode Property

The calculation could not be executed as configured. Select an output node before analyzing this network.

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_NoOutputNode { get; }
```